# 12_dataframe_info
### The use of tools like to_numpy(), values(), describe(), info()

In [1]:
import numpy as np
import pandas as pd

np.set_printoptions(suppress=True)

In [2]:
data = [[6172, 34.5, 53550], [1132, 32.8, 46601], [437, 32.8, 55170], [723, 31.1, 35186], [429, 36.1, 70172]]

In [3]:
columns = ['elevation', 'median_age', 'median_income']
index = ['Colorado Springs', 'Phoenix', 'Raleigh', 'Milwaukee', 'Seattle']

In [4]:
df4 = pd.DataFrame(data, index=index, columns=columns)

In [5]:
df4

                  elevation  median_age  median_income
Colorado Springs       6172        34.5          53550
Phoenix                1132        32.8          46601
Raleigh                 437        32.8          55170
Milwaukee               723        31.1          35186
Seattle                 429        36.1          70172

In [6]:
df4.to_numpy()

array([[ 6172. ,    34.5, 53550. ],
       [ 1132. ,    32.8, 46601. ],
       [  437. ,    32.8, 55170. ],
       [  723. ,    31.1, 35186. ],
       [  429. ,    36.1, 70172. ]])

In [7]:
df4.values

array([[ 6172. ,    34.5, 53550. ],
       [ 1132. ,    32.8, 46601. ],
       [  437. ,    32.8, 55170. ],
       [  723. ,    31.1, 35186. ],
       [  429. ,    36.1, 70172. ]])

In [8]:
df4.describe()

        elevation  median_age  median_income
count     5.00000    5.000000       5.000000
mean   1778.60000   33.460000   52135.800000
std    2472.63307    1.903418   12791.018067
min     429.00000   31.100000   35186.000000
25%     437.00000   32.800000   46601.000000
50%     723.00000   32.800000   53550.000000
75%    1132.00000   34.500000   55170.000000
max    6172.00000   36.100000   70172.000000

In [9]:
df4.info(verbose=True)

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Colorado Springs to Seattle
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   elevation      5 non-null      int64
 1   median_age     5 non-null      float64
 2   median_income  5 non-null      int64
dtypes: float64(1), int64(2)
memory usage: 160.0+ bytes

In [10]:
df4.T

               Colorado Springs  Phoenix  Raleigh  Milwaukee  Seattle
elevation                6172.0   1132.0    437.0      723.0    429.0
median_age                 34.5     32.8     32.8       31.1     36.1
median_income           53550.0  46601.0  55170.0    35186.0  70172.0